/*Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

456 -> 5
782 -> 8
918 -> 1*/

 /*int Secondnumbember (int num)
   {
    int dec = num/10;
    int res = dec%10;
    return res;
   }
int random = new Random().Next(100,1000);
int newNumber = Secondnumbember(random);
Console.WriteLine($"New version of {random} is {newNumber}");*/

