/*Задача 64: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.
N = 5 -> "5, 4, 3, 2, 1"
N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"*/
/*void ShowNumber(int n)
{
    if(n>=1)
    {
        Console.Write(n+" ");
        ShowNumber(n-1);
    }
}
ShowNumber(8);*/
/*Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.
M = 1; N = 15 -> 120
M = 4; N = 8. -> 30*/

 /*int SumNumbers(int M, int N)
{
    if (M == 0) return (N * (N + 1)) / 2;            
    else if (N == 0) return (M * (M + 1)) / 2;       
    else if (M == N) return M;                       
    else if (M < N) return N + SumNumbers(M, N - 1); 
    else return N + SumNumbers(M, N + 1);            
}
Console.Write("Введите значение M ");
int M = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите значение N ");
int N = Convert.ToInt32(Console.ReadLine());
Console.WriteLine($"Сумма чисел {SumNumbers(M, N)}");*/



